Simulation_files/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];  // Pressure = pressureyouwant/rho

internalField   uniform 0;

boundaryField
{
    inlet
    {
                type            fixedValue;
       		value           uniform 0.002;
     }
    outlet
    {
        type            fixedValue;
        value           uniform 0; 
    }
    
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
