Simulation_files/constant/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

scale 3e-2;

  vertices
(

    
    (-1 -1 -1)
    (1  -1 -1)
    (1 1 -1 )
    (-1 1 -1)
    (-1 -1 1 )
    (1 -1 1)
    (1 1 1)
    (-1 1 1 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (21 21 21) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
outlet
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
  
inlet 
    {type wall;
        faces
        (
            (1 5 4 0)
        );
    }
walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
        
            (2 6 5 1)
        
            (0 3 2 1)


            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
