Simulation_files/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType   laminar ;

// RAS
// {
//     RASModel        kEpsilon;
// 
//     turbulence      on;
// 
//     printCoeffs     on;
// 
//     // custom K-epsilon coefficients
//     sigmaEps	    1.2;
//     C2 		    1.9;
// }

// ************************************************************************* //
