Simulation_files/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

scale 1e-6;

  vertices
(
    
    (0 0 0)
    (20  0 0)
    (20 80 0)
    (0 80 0)
    (0 0 20)
    (20 0 20)
    (20 80 20)
    (0 80 20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 120 30) simpleGrading (1 1 1) //Take care of the mesh refinement
);

edges
(
);

boundary
(
outlet
    {
        type outlet;
        faces
        (
            (3 7 6 2)
        );
    }
  
inlet 
    {type inlet;
        faces
        (
            (1 5 4 0)
        );
    }
walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
        
            (2 6 5 1)
        
            (0 3 2 1)


            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
