Simulation_files/system/surfaceFeatureExtractDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object surfaceFeatureExtractDict;
}

inlet.stl
{
  extractionMethod extractFromSurface;
  
  extractFromSurfaceCoeffs
  {
    includedAngle 30; //between 0 - 180
  } 	// How to obtain raw features (extractFromFile || extractFromSurface)// Mark edges whose adjacent surface normals are at an angle less// than includedAngle as features// - 0  : selects no edges// - 180: selects all edges// Write options// Write features to obj format for postprocessing
  
  subsetFeatures
  {
    //nonManifoldEdges no;
    //openEdges yes;
  }
  writeObj yes;
}

outlet.stl
{
  extractionMethod extractFromSurface;
  
  extractFromSurfaceCoeffs
  {
    includedAngle 30; //between 0 - 180
  } 	// How to obtain raw features (extractFromFile || extractFromSurface)// Mark edges whose adjacent surface normals are at an angle less// than includedAngle as features// - 0  : selects no edges// - 180: selects all edges// Write options// Write features to obj format for postprocessing
  
  subsetFeatures
  {
    //nonManifoldEdges yes;
    //openEdges yes;
  }
  writeObj yes;
}

walls.stl
{
  extractionMethod extractFromSurface;
  
  extractFromSurfaceCoeffs
  {
    includedAngle 30; //between 0 - 180
  } 	// How to obtain raw features (extractFromFile || extractFromSurface)// Mark edges whose adjacent surface normals are at an angle less// than includedAngle as features// - 0  : selects no edges// - 180: selects all edges// Write options// Write features to obj format for postprocessing
  
  subsetFeatures
  {
    //nonManifoldEdges yes;
    //openEdges yes;
  }
  writeObj yes;
}


// scaffold.stl// {//     // How to obtain raw features (extractFromFile || extractFromSurface)//     extractionMethod    extractFromSurface;// //     extractFromSurfaceCoeffs//     {//         // Mark edges whose adjacent surface normals are at an angle less//         // than includedAngle as features//         // - 0  : selects no edges//         // - 180: selects all edges//         includedAngle   150;//     }// //     // Write options// //         // Write features to obj format for postprocessing//         writeObj                yes;// }// ************************************************************************* //
